CREATE DATABASE  IF NOT EXISTS `kesulu_online` /*!40100 DEFAULT CHARACTER SET utf8 */ /*!80016 DEFAULT ENCRYPTION='N' */;
USE `kesulu_online`;
-- MySQL dump 10.13  Distrib 8.0.26, for Win64 (x86_64)
--
-- Host: localhost    Database: kesulu_online
-- ------------------------------------------------------
-- Server version	8.0.19

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `weapon_list`
--

DROP TABLE IF EXISTS `weapon_list`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `weapon_list` (
  `WeaponId` int unsigned NOT NULL AUTO_INCREMENT,
  `WeaponType` varchar(60) NOT NULL,
  `RequiredSkill` varchar(14) NOT NULL,
  `Damage` varchar(60) NOT NULL,
  `Range` varchar(60) NOT NULL,
  `Piercing` tinyint unsigned NOT NULL,
  `AttackTimes` varchar(20) NOT NULL,
  `AmmoCapacity` varchar(20) NOT NULL,
  `FailureRate` varchar(8) NOT NULL,
  `Era` varchar(20) DEFAULT NULL,
  `Price` varchar(40) NOT NULL,
  PRIMARY KEY (`WeaponId`),
  UNIQUE KEY `WeaponId_UNIQUE` (`WeaponId`)
) ENGINE=InnoDB AUTO_INCREMENT=105 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `weapon_list`
--

LOCK TABLES `weapon_list` WRITE;
/*!40000 ALTER TABLE `weapon_list` DISABLE KEYS */;
INSERT INTO `weapon_list` VALUES (1,'弓箭','弓术','1D6+半DB','30码',0,'1','1','97','1920s,现代','7/75'),(2,'黄铜指虎','斗殴','1D3+1+DB','接触',0,'1','——','——','1920s,现代','1/10'),(3,'长鞭','鞭子','1D3+半DB','10步',0,'1','——','——','1920s','5/50'),(4,'燃烧的火把','斗殴','1D6+燃烧','接触',0,'1','——','——','1920s,现代','0.05/0.5'),(5,'电锯','电锯','2D8','接触',1,'1','——','95','现代','——/300'),(6,'包皮铁棍(甩棍、护身短棒)','斗殴','1D8+DB','接触',0,'1','——','——','1920s,现代','2/15'),(7,'大型棍状物(棒球棍、板球棒、拨火棍等)','斗殴','1D8+DB','接触',0,'1','——','——','1920s,现代','3/35'),(8,'小型棍状物(警棍等)','斗殴','1D6+DB','接触',0,'1','——','——','1920s,现代','3/35'),(9,'弩','弓术','1D8+2','50码',1,'1/2','1','96','1920s,现代','10/100'),(10,'绞具','绞具','1D6+DB','接触',1,'1','——','——','1920s,现代','0.5/3'),(11,'斧头/镰刀','斧','1D6+1+DB','接触',1,'1','——','——','1920s,现代','3/9'),(12,'大型刀具(大砍刀等)','斗殴','1D8+DB','接触',1,'1','——','——','1920s,现代','4/50'),(13,'中型刀具(切肉菜刀等)','斗殴','1D4+2+DB','接触',1,'1','——','——','1920s,现代','2/15'),(14,'小型刀具(弹簧折叠刀等)','斗殴','1D4+DB','接触',1,'1','——','——','1920s,现代','2/6'),(15,'220v通电导线','斗殴','2D8+眩晕','接触',0,'1','——','95','现代','——'),(16,'催泪瓦斯','斗殴','眩晕','6步',0,'1','25次','95','1920s,现代','——/10'),(17,'双节棍','链枷','1D8+DB','接触',0,'1','——','——','1920s,现代','1/10'),(18,'投石','投掷','1D4+半DB','STR/5步',0,'1','——','——','1920s,现代','——'),(19,'手里剑','投掷','1D3+半DB','20码',1,'2','一次性','100','1920s,现代','0.5/3'),(20,'矛、骑士长枪','矛','1D8+1','接触',1,'1','——','——','1920s,现代','25/150'),(21,'掷矛','投掷','1D8+半DB','STR/5码',1,'1','——','——','罕见','1/25'),(22,'大型剑(马刀)','剑','1D8+1+DB','接触',0,'1','——','——','1920s,现代','30/75'),(23,'中型剑(佩剑等)','剑','1D6+1+DB','接触',1,'1','——','——','1920s,现代','15/100'),(24,'轻剑(击剑、剑杖等)','剑','1D6+DB','接触',1,'1','——','——','1920s,现代','25/100'),(25,'电棍','斗殴','1D3+眩晕','接触',0,'1','不定','97','现代','——/200'),(26,'电击枪(远程)','手枪','1D3+眩晕','15步',0,'1','3','95','现代','——/400'),(27,'利刃回旋镖','投掷','1D8+半DB','20码',0,'1','——','——','罕见','2/4'),(28,'伐木斧','斧','1D8+2+DB','接触',1,'1','——','——','1920s,现代','5/10'),(29,'遂发枪','手枪','1D6+1','10',1,'1/4','1','95','罕见','30/300'),(30,'.22 短口自动手枪','手枪','1D6','10',1,'1(3)','6','100','1920s,现代','25/190'),(31,'.25 短口手枪 (单管)','手枪','1D6','3',1,'1','1','100','1920s','12/55'),(32,'.32 or 7.65mm 左轮手枪','手枪','1D8','15',1,'1(3)','6','100','1920s,现代','15/200'),(33,'.32 or 7.65mm 自动手枪','手枪','1D8','15',1,'1(3)','8','99','1920s,现代','20/350'),(34,'.357 Magnum 左轮手枪','手枪','1D8+1D4','15',1,'1(3)','6','100','现代','1/425'),(35,'.38 or 9mm 左轮手枪','手枪','1D10','15',1,'1(3)','6','100','1920s,现代','25/200'),(36,'.38 自动手枪','手枪','1D10','15',1,'1(3)','8','99','1920s,现代','30/375'),(37,'贝雷塔M9','手枪','1D10','15',1,'1(3)','15','98','现代','——/500'),(38,'格洛克17 9mm 自动手枪','手枪','1D10','15',1,'1(3)','17','98','现代','——/500'),(39,'鲁格P08','手枪','1D10','15',1,'1(3)','8','99','1920s,现代','75/600'),(40,'.41 左轮手枪','手枪','1D10','15',1,'1(3)','8','100','1920s,罕见','30/——'),(41,'.44 马格南左轮手枪','手枪','1D10+1D4+2','15',1,'1(3)','6','100','现代','1/475'),(42,'.45 左轮手枪','手枪','1D10+2','15',1,'1(3)','6','100','1920s,现代','30/300'),(43,'.45 自动手枪','手枪','1D10+2','15',1,'1(3)','7','100','1920s,现代','40/375'),(44,'沙漠之鹰','手枪','1D10+1D6+3','15',1,'1(3)','7','94','现代','——/650'),(45,'.58 斯普林菲尔德步枪','步枪/霰弹枪','1D10+4','60',1,'1/4','1','95','罕见','25/350'),(46,'.22 杠杆式枪机步枪','步枪/霰弹枪','1D6+1','30',1,'1','6','99','1920s,现代','13/70'),(47,'.30 卡宾枪','步枪/霰弹枪','2D6','50',1,'1','6','98','1920s,现代','19/150'),(48,'.45 马提尼·亨利步枪','步枪/霰弹枪','1D8+1D6+3','80',1,'1/3','1','100','1920s','20/200'),(49,'莫兰上校的气动步枪','步枪/霰弹枪','2D6+1','20',1,'1/3','1','88','1920s','200'),(50,'加兰德M1、M2步枪','步枪/霰弹枪','2D6+4','110',1,'1','8','100','二战晚期','400'),(51,'SKS半自动步枪','步枪/霰弹枪','2D6+1','90',1,'1(2)','10','97','现代','500'),(52,'.303 (7.7mm) 李恩菲尔德','步枪/霰弹枪','2D6+4','110',1,'1','5','100','1920s,现代','50/300'),(53,'.30——06 (7.62mm) 栓式枪机步枪','步枪/霰弹枪','2D6+4','110',1,'1','5','100','1920s,现代','75/175'),(54,'.30——06 (7.62mm) 半自动步枪','步枪/霰弹枪','2D6+4','110',1,'1','5','100','现代','275'),(55,'.444 (11.28mm) 马林步枪','步枪/霰弹枪','2D8+4','110',1,'1','5','98','现代','400'),(56,'猎象枪(双管)','步枪/霰弹枪','3D6+4','100',1,'1 or 2','2','100','1920s,现代','400/1800'),(57,'20号霰弹枪(双管)','步枪/霰弹枪','2D6/1D6/1D3','10/20/50',0,'1 or 2','2','100','1920s','35/稀有'),(58,'16号霰弹枪(双管)','步枪/霰弹枪','2D6+2/1D6+1/1D4','10/20/50',0,'1 or 2','2','100','1920s','40/稀有'),(59,'12号霰弹枪(双管)','步枪/霰弹枪','4D6/2D6/1D6','10/20/50',0,'1 or 2','2','100','1920s,现代','40/200'),(60,'12号泵动霰弹枪','步枪/霰弹枪','4D6/2D6/1D6','10/20/50',0,'1','5','100','现代','45/100'),(61,'12号半自动霰弹枪','步枪/霰弹枪','4D6/2D6/1D6','10/20/50',0,'2','5','100','现代','45/100'),(62,'削短12号双管霰弹枪','步枪/霰弹枪','4D6/1D6','5/10',0,'1 or 2','2','100','1920s','N/A'),(63,'10号霰弹枪(双管)','步枪/霰弹枪','4D6+2/2D6+1/1D4','10/20/50',0,'1 or 2','2','100','1920s罕见','稀有'),(64,'12号贝里尼M3 (折叠式枪托)','步枪/霰弹枪','4D6/2D6/1D6','10/20/50',0,'1 or 2','7','100','现代','——/895'),(65,'12号SPAS (折叠式枪托)','步枪/霰弹枪','4D6/2D6/1D6','10/20/50',0,'1','8','98','现代','——/600'),(66,'AK——47 or AKM','步枪/霰弹枪','2D6+1','100',1,'1(2)or全自动','30','100','现代','——/200'),(67,'AK——74 ','步枪/霰弹枪','2D6','110',1,'1(2)or全自动','30','97','现代','——/1000'),(68,'巴雷特M82','步枪/霰弹枪','2D10+1D8+6','250',1,'1','11','96','现代','——/3000'),(69,'FN FAL Light Automatic','步枪/霰弹枪','2D6+4','110',1,'1(2)or3','20','97','现代','——/1500'),(70,'Galil Assault Rifle','步枪/霰弹枪','2D6','110',1,'1(2)or3','20','98','现代','——/2000'),(71,'M16A2','步枪/霰弹枪','2D6','110',1,'1(2)or3','30','97','现代','N/A'),(72,'M4','步枪/霰弹枪','2D6','90',1,'1(2)or3','30','97','现代','N/A'),(73,'Steyr AUG ','步枪/霰弹枪','2D6','110',1,'1(2)or全自动','30','99','现代','——/1100'),(74,'巴雷特M70/90','步枪/霰弹枪','2D6','110',1,'1(or全自动','30','99','现代','——/2800'),(75,'贝格曼MP181/ MP2811','冲锋枪','1D10','20',1,'1(2)or全自动','20/30/32','96','1920s','1000/20000'),(76,'黑克勒——科赫MP5','冲锋枪','1D10','20',1,'1(2)or全自动','15/30','97','现代','N/A'),(77,'MAC——11','冲锋枪','1D10','15',1,'1(3)or全自动','32','96','现代','——/750'),(78,'蝎式冲锋枪','冲锋枪','1D8','15',1,'1(3)or全自动','20','96','现代','N/A'),(79,'汤普森冲锋枪','冲锋枪','1D10+2','20',1,'1or全自动','20/30/50','96','1920s','200/1600'),(80,'乌兹微型冲锋枪','冲锋枪','1D10','20',1,'1(2)or全自动','32','98','现代','——/1000'),(81,'M1882加特林机枪','机关枪','2D6+4','100',1,'全自动','200','96','1920s罕见','2000/14000'),(82,'M1918式勃朗宁自动步枪','机关枪','2D6+4','90',1,'1(2)or全自动','20','100','1920s','800/1500'),(83,'M1917A1式勃朗宁重机枪','机关枪','2D6+4','150',1,'全自动','250','96','1920s','3000/30000'),(84,'布伦式轻机枪','机关枪','2D6+4','110',1,'1or全自动','30/100','96','1920s','3000/50000'),(85,'刘易斯式轻机枪','机关枪','2D6+4','110',1,'全自动','27/97','96','1920s','3000/20000'),(86,'Minigun','机关枪','2D6+4','200',1,'全自动','4000','98','现代','N/A'),(87,'FNMinimi5.56mm轻机枪','机关枪','2D6','110',1,'全自动','30/200','99','现代','N/A'),(88,'维克斯MK1式机枪','机关枪','2D6+4','110',1,'全自动','250','99','1920s','N/A'),(89,'燃烧瓶','投掷','2D6+燃烧','STR/5码',1,'1/2','一次性','95','1920s,现代','N/A'),(90,'信号枪','手枪','1D10+1D3+燃烧','10',1,'1/2','1','100','1920s,现代','15/75'),(91,'M79榴弹发射器','重武器','3D10/2码','20',1,'1/3','1','99','现代','N/A'),(92,'土制炸药','投掷','4D10/3码','STR/5步',1,'1/2','一次性','99','1920s,现代','2/5'),(93,'雷管','电气维修','2D10/1码','N/A',1,'N/A','一次性','100','1920s,现代','20/box'),(94,'管状炸弹','爆破','1D10/3码','布置',1,'一次使用','一次性','95','1920s,现代','N/A'),(95,'塑胶炸弹(C4) 100克','爆破','6D10/3码','布置',1,'一次使用','一次性','99','现代','N/A'),(96,'手榴弹*','投掷','4D10/3码','STR/5步',1,'1/2','一次性','99','1920s,现代','N/A'),(97,'81mm迫击炮','炮术','6D10/6码','500码',1,'2','独立','100','现代','N/A'),(98,'75mm野战炮','炮术','10D10/2码','500码',1,'1/4','独立','99','1920s,现代','1500'),(99,'120mm坦克炮(稳定)','炮术','15D10/4码','2000码',1,'1','独立','100','现代','N/A'),(100,'5英寸舰载炮(稳定)','炮术','12D10/4码','3000码',1,'2','自动','98','现代','N/A'),(101,'反步兵地雷','爆破','4D10/5码','布置',1,'布置','一次性','99','1920s,现代','N/A'),(102,'阔剑地雷','爆破','6D6/20码','布置',1,'布置','一次性','99','现代','N/A'),(103,'火焰喷射器','火焰喷射器','2D6+燃烧','25码',1,'1','至少10','93','1920s,现代','N/A'),(104,'轻型反坦克武器*','重武器','8d10/1码','150码',1,'1','1','98','现代','N/A');
/*!40000 ALTER TABLE `weapon_list` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2022-03-04 19:09:18
