CREATE DATABASE  IF NOT EXISTS `kesulu_online` /*!40100 DEFAULT CHARACTER SET utf8 */ /*!80016 DEFAULT ENCRYPTION='N' */;
USE `kesulu_online`;
-- MySQL dump 10.13  Distrib 8.0.26, for Win64 (x86_64)
--
-- Host: localhost    Database: kesulu_online
-- ------------------------------------------------------
-- Server version	8.0.19

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `job_list`
--

DROP TABLE IF EXISTS `job_list`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `job_list` (
  `job_id` int unsigned NOT NULL AUTO_INCREMENT,
  `job_name` varchar(60) NOT NULL,
  `credit_range` varchar(10) NOT NULL,
  `skill_point_formula` varchar(60) NOT NULL,
  `jobS_skills` varchar(300) NOT NULL,
  PRIMARY KEY (`job_id`)
) ENGINE=InnoDB AUTO_INCREMENT=34 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `job_list`
--

LOCK TABLES `job_list` WRITE;
/*!40000 ALTER TABLE `job_list` DISABLE KEYS */;
INSERT INTO `job_list` VALUES (1,'会计师','30-70','教育×4','会计，法律，图书馆，聆听，说服，侦查，任意其他两项个人或时代特长。'),(2,'杂技演员','9-20','教育×2＋敏捷×2','攀爬，闪避，跳跃，投掷，侦查，游泳，任意两项其他个人或时代特长。'),(3,'演员-戏剧演员','9-40','教育×2＋外貌×2','技艺（表演），乔装，格斗，历史，两项社交技能（魅惑、话术、恐吓、说服），心理学，任意一项其他个人或时代特长。'),(4,'演员-电影演员','20-90','教育×2＋外貌×2','技艺（表演），乔装，汽车驾驶，两项社交技能（魅惑、话术、恐吓、说服），心理学，任意两项其他个人或时代特长（如骑乘或格斗）。'),(5,'事务所侦探、保安','20-45','教育×2＋力量或敏捷×2','一项社交技能（魅惑、话术、恐吓、说服），格斗（斗殴），射击，法律，图书馆，心理学，潜行，追踪。'),(6,'精神病医生（古典）','10-60','教育×4','法律，聆听，医学，外语，精神分析，心理学，科学（生物学，化学）。'),(7,'动物训练师','10-40','教育×2＋外貌或意志×2','跳跃，聆听，自然，心理学，科学（动物学），潜行，追踪，任意一项其他个人或时代特长。'),(8,'文物学家（原作向）','30-70','教育×4','估价，技艺（任一），历史，图书馆，外语，一项社交技能（魅惑、话术、恐吓、说服），侦查，任意一项其他个人或时代特长。'),(9,'古董商','30-50','教育×4','会计，估价，汽车驾驶，两项社交技能（魅惑、话术、恐吓、说服），历史，图书馆，导航。'),(10,'考古学家（原作向）','10-40','教育×4','估价，考古，历史，外语，图书馆，侦查，机械维修，导航或科学（任一：如化学、物理、地理等）。'),(11,'建筑师','30-70','教育×4','会计，技艺（技术制图），法律，母语，计算机或图书馆，说服，心理学，科学（数学）。'),(12,'艺术家','9-50','教育×2＋敏捷或意志×2','技艺（任一），历史或自然，一项社交技能（魅惑、话术、恐吓、说服），外语，心理学，侦查，任意两项其他个人或时代特长。'),(13,'精神病院看护','8-20','教育×2＋力量或敏捷×2','闪避，格斗（斗殴），急救，两项社交技能（魅惑、话术、恐吓、说服），聆听，心理学，潜行。'),(14,'运动员','9-70','教育×2＋敏捷或力量×2','攀爬，跳跃，格斗（斗殴），骑乘，一项社交技能（魅惑、话术、恐吓、说服），游泳，投掷，任意一项其他个人或时代特长。'),(15,'作家（原作向）','9-30','教育×4','技艺（文学），历史，图书馆，自然或神秘学，外语，母语，心理学，任意一项其他个人或时代特长。'),(16,'酒保','8-25','教育×2＋外貌×2','会计，两项社交技能（魅惑、话术、恐吓、说服），格斗（斗殴），聆听，心理学，侦查，任意一项其他个人或时代特长。'),(17,'猎人','20-50','教育×2＋敏捷或力量×2','射击，聆听或侦查，自然，导航，外语或生存（任一），科学（生物学或植物学），潜行，追踪。'),(18,'书商','20-40','教育×4','会计，估价，汽车驾驶，历史，图书馆，母语，外语，一项社交技能（魅惑、话术、恐吓、说服）。'),(19,'赏金猎人','9-30','教育×2＋敏捷或力量×2','汽车驾驶，电子学或电气维修，格斗或射击，一项社交技能（魅惑、话术、恐吓、说服），法律，心理学，追踪，潜行。'),(20,'拳击手、摔跤手','9-60','教育×2＋力量×2','闪避，格斗（斗殴），恐吓，跳跃，心理学，侦查，任意两项其他个人或时代特长。'),(21,'管家、男仆、女仆','9-40','教育×4','会计或估价，技艺（任一：如烹饪、裁缝、理发），急救，聆听，外语，心理学，侦查，任意一项其他个人或时代特长。'),(22,'神职人员','9-60','教育×4','会计，历史，图书馆，聆听，外语，一项社交技能（魅惑、话术、恐吓、说服），心理学，任意一项其他技能。'),(23,'程序员、电子工程师（现代）','10-70','教育×4','计算机，电气维修，电子学、图书馆，科学（数学），侦查，任意两项其他个人或时代特长。'),(24,'黑客/骇客（现代）','10-70','教育×4','计算机，电气维修，电子学，图书馆，侦查，一项社交技能（魅惑、话术、恐吓、说服），任意两项其他技能。'),(25,'牛仔','9-20','教育×2+敏捷或力量×2','闪避，格斗或射击，急救或自然，跳跃，骑乘，生存（任一），投掷，追踪。'),(26,'工匠','10-40','教育×2＋敏捷×2','会计，技艺（任二），机械维修，自然，侦查，任意两项其他个人或时代特长。'),(27,'罪犯-刺客','30-60','教育×2＋敏捷或力量×2','乔装，电气维修，格斗，射击，锁匠，机械维修，潜行，心理学。'),(28,'罪犯-银行劫匪','5-75','教育×2＋力量或敏捷×2','汽车驾驶，电气维修或机械维修，格斗，射击，恐吓，锁匠，操作重型机械，任意一项其他个人或时代特长。'),(29,'罪犯-打手、暴徒','5-30','教育×2＋力量×2','汽车驾驶，格斗，射击，两项社交技能（魅惑、话术、恐吓、说服），心理学，潜行，侦查。'),(30,'罪犯-窃贼','5-40','教育×2＋敏捷×2','估价，攀爬，电气维修或机械维修，聆听，锁匠，妙手，潜行，侦查。'),(31,'罪犯-欺诈师','10-65','教育×2＋外貌×2','估价，技艺（表演），法律或外语，聆听，两项社交技能（魅惑、话术、恐吓、说服），心理学，妙手。'),(32,'罪犯-独行罪犯','5-65','教育×2＋敏捷或外貌×2','技艺（表演）或乔装，估价，一项社交技能（魅惑、话术、恐吓、说服），格斗或射击，锁匠或机械维修，潜行，心理学，侦查。'),(33,'罪犯-女飞贼（古典）','10-80','教育×2＋外貌×2','技艺（任意），两项社交技能（魅惑、话术、恐吓、说服），格斗（斗殴）或射击（手枪），汽车驾驶，聆听，潜行，任意一项其他个人或时代特长');
/*!40000 ALTER TABLE `job_list` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2022-03-04 19:09:17
